# ShowDataName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..ShowDataName Property
AnalysisDisplayLegendSettings Class See Also
---
If true, data name is shown in the legend.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool ShowDataName { get; set; }
```

Visual Basic
---
```text
Public Property ShowDataName As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowDataName {
	bool get ();
	void set (bool value);
}
```

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace